nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_coord.c
/******************************************************************************

 @file  mac_coord.c

 @brief This module implements MAC device management procedures for a
        coordinator.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2005-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */

#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

#include "hal_mcu.h"
#include "timac_api.h"
#include "mac_spec.h"
#include "mac_main.h"
#include "mac_timer.h"
#include "mac_mgmt.h"
#include "mac_data.h"
#include "mac_pib.h"
#include "mac_coord.h"
#include "mac_security.h"
#include "mac_low_level.h"
#include "mac_ie_build.h"

#include "rom_jt_154.h"

// SW Tracer
#include "dbg.h"
#ifdef DEBUG_SW_TRACE
#define DBG_ENABLE
#ifndef _DBGFILE
#define _DBGFILE mac_coord_c
#endif
#include "dbgid_sys_mst.h"
#endif // DEBUG_SW_TRACE
/* ------------------------------------------------------------------------------------------------
 *                                           Local Variables
 * ------------------------------------------------------------------------------------------------
 */


/* ------------------------------------------------------------------------------------------------
 *                                           Local Functions
 * ------------------------------------------------------------------------------------------------
 */
void macIndirectMark(macTx_t *pMsg);
void macIndirectTxFrame(macTx_t *pMsg);
void macIndirectRequeueFrame(macTx_t *pMsg);

/**************************************************************************************************
 * @fn          macCoordReset
 *
 * @brief       This function initializes the data structures for module coord.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macCoordReset(void)
{
  /* Coordinator action set 1 */
  macCoordAction1[0] = MAP_macApiStartReq;
  /* Coordinator action set 2 */
  macCoordAction2[0] = MAP_macStartComplete;
  /* Coordinator action set 3 */
  macCoordAction3[0] = MAP_macApiPurgeReq;

  if (macCoord.pStartReq != NULL)
  {
    MAP_osal_mem_free(macCoord.pStartReq);
  }
  macCoord.indirectTimer.pFunc = MAP_macSetEvent;
  macCoord.indirectTimer.parameter = MAC_EXP_INDIRECT_TASK_EVT;
  macCoord.pStartReq = NULL;
  macMgmt.networkStarted = FALSE;
  macCoord.beaconing = FALSE;
  MAP_osal_memset(&macCoord.realignSec, 0, sizeof(ApiMac_sec_t));
  MAP_osal_memset(&macCoord.beaconSec, 0, sizeof(ApiMac_sec_t));
}

/**************************************************************************************************
 * @fn          macBuildAssociateRsp
 *
 * @brief       This function builds and sends an associate response command frame in buffer
 *              pEvent.  The TX options and frame type are set and other parameters in
 *              the macTx_t structure are initialized.  Then macBuildHeader() is called to
 *              build the header with the address information from the API event structure.
 *              If successful the status and the short address are built in the frame and
 *              macDataTxEnqueue() is called to queue the frame for transmission.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macBuildAssociateRsp(macEvent_t *pEvent)
{
  sAddr_t   dstAddr;
  uint8     status;

