nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_coord.c
  /* set parameters */
  pEvent->tx.internal.txOptions = MAC_TXOPTION_ACK | MAC_TXOPTION_INDIRECT;

  pEvent->tx.internal.frameType = MAC_INTERNAL_ASSOC_RSP;

  /* build status */
  pEvent->tx.msdu.p--;
  *pEvent->tx.msdu.p-- = pEvent->apiData.mac.associateRsp.status;

  /* build short address */
  if (pEvent->apiData.mac.associateRsp.status != MAC_SUCCESS)
  {
    pEvent->apiData.mac.associateRsp.assocShortAddress = MAC_SHORT_ADDR_NONE;
  }
  *pEvent->tx.msdu.p-- = HI_UINT16(pEvent->apiData.mac.associateRsp.assocShortAddress);
  *pEvent->tx.msdu.p-- = LO_UINT16(pEvent->apiData.mac.associateRsp.assocShortAddress);

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
  /* Only the private payload field(Command Contents in case of command frame)
     should be secured. */
  pEvent->tx.internal.ptrMData = pEvent->tx.msdu.p + 1;
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif

#endif

  /* Command Identifier */
  *pEvent->tx.msdu.p = pEvent->tx.internal.frameType - 1;

  /* set length */
  pEvent->tx.msdu.len += MAC_ASSOC_RSP_PAYLOAD;

  /* set up destination address */
  MAP_sAddrExtCpy(dstAddr.addr.extAddr, pEvent->apiData.mac.associateRsp.deviceAddress);
  dstAddr.addrMode = SADDR_MODE_EXT;

  /* initialize IE pointers */
  pEvent->tx.internal.ptrHeaderIE = NULL;
  pEvent->tx.internal.ptrPayloadIE = NULL;
#ifdef FEATURE_FREQ_HOP_MODE
  /* Frequency hopping enabled */
  if ( MAC_FH_ENABLED )
  {
    pEvent->tx.internal.fhFrameType = MAC_FH_FRAME_DATA;

    pEvent->tx.internal.nb = 0;
    pEvent->tx.internal.be = (pEvent->tx.internal.txOptions & MAC_TXOPTION_ALT_BE) ? pMacPib->altBe : pMacPib->minBe;

    /* Copy the address (needs to be extended) for FH module to use */

    pEvent->tx.internal.dest.dstAddr.addrMode = SADDR_MODE_EXT;
    /*Assoc. Rsp always has ext. addr */
      MAP_sAddrExtCpy(pEvent->tx.internal.dest.destAddr, pEvent->apiData.mac.associateRsp.deviceAddress);
      if(pMacPib->rxOnWhenIdle)
      {
        /* include the necessary Payaload IE's */
        if ( macCmdIncludeFHIe[MAC_INTERNAL_ASSOC_RSP] & MAC_FH_PAYLOAD_IE_MASK )
        {
          pEvent->apiData.internal.payloadIeInfo[0].gId = MAC_PAYLOAD_IE_WISUN_GID;
          pEvent->apiData.internal.payloadIeInfo[0].subId.subIdBMap =
          macCmdIncludeFHIe[MAC_INTERNAL_ASSOC_RSP] & MAC_FH_PAYLOAD_IE_MASK;

          MAP_macBuildPayloadIes(&pEvent->tx, pEvent->apiData.internal.payloadIeInfo, TRUE, FALSE);
        }

        /* include the necessary header IE's */
        if ( macCmdIncludeFHIe[MAC_INTERNAL_ASSOC_RSP] & MAC_FH_HEADER_IE_MASK )
        {
          pEvent->apiData.internal.headerIeInfo[0].elementId = MAC_HEADER_IE_WISUN;
          pEvent->apiData.internal.headerIeInfo[0].subIdBitMap =
          macCmdIncludeFHIe[MAC_INTERNAL_ASSOC_RSP] & MAC_FH_HEADER_IE_MASK;

          MAP_macBuildHeaderIes(&pEvent->tx, pEvent->apiData.internal.headerIeInfo);
        }
      }
  }
#endif
  status = MAP_macBuildHeader(&pEvent->tx, SADDR_MODE_EXT, &dstAddr, pMacPib->panId, 0);
  if (status == MAC_SUCCESS)
  {
    /* queue frame for transmission */
    MAP_macDataTxEnqueue(&pEvent->tx);
  }
  return status;
}

/**************************************************************************************************
 * @fn          macBuildRealign
 *
 * @brief       This function builds and sends a coordinator realignment command frame.
 *              First a buffer is allocated with macAllocTxBuffer().  If successful the
 *              frame type is set and other parameters in the macTx_t structure
 *              are initialized.  Then macBuildHeader() is called to build the header with the
 *              address information from the API event structure.  If successful the PAN ID
 *              and logical channel are built in the frame and macDataTxEnqueue() is called
 *              to queue the frame for transmission.
 *
 * input parameters
 *
 * @param       pMsg - Pointer to message buffer.
 * @param       pDstAddr - Destination address.
 * @param       coordShortAddr - Coordinator short address.
 * @param       newPanId - New PAN ID in realignment message frame.
 * @param       logicalChannel - Logical channel in realignment message frame.
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macBuildRealign(macTx_t *pMsg, sAddr_t *pDstAddr, uint16 dstShortAddr,
                                       uint16 newPanId, uint8 logicalChannel)
{
  uint8   *p;
  uint8   status;

  pMsg->internal.frameType = MAC_INTERNAL_COORD_REALIGN;

  p = pMsg->msdu.p - 1;

  /* Short Addr */
  *p-- = HI_UINT16(dstShortAddr);
  *p-- = LO_UINT16(dstShortAddr);

  /* Logical Channel */
  *p-- = logicalChannel;

  /* Coord Addr */
  *p-- = HI_UINT16(pMacPib->shortAddress);
  *p-- = LO_UINT16(pMacPib->shortAddress);

  /* PAN ID */
  *p-- = HI_UINT16(newPanId);
  *p-- = LO_UINT16(newPanId);

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      /* Only the private payload field(Command Contents in case of command frame)
         should be secured. */
      pMsg->internal.ptrMData = p + 1;
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif

  /* set command id field */
  *p = pMsg->internal.frameType - 1;

  /* set length */
  pMsg->msdu.len += (uint8) (pMsg->msdu.p - p);
  pMsg->msdu.p = p;

  /* build header */
  if (pDstAddr->addrMode == SADDR_MODE_EXT)
  {
    pMsg->internal.txOptions = MAC_TXOPTION_ACK;
  }
  else
  {
    pMsg->internal.txOptions = 0;
  }

  /* Copy security parameter from start request */
  MAP_osal_memcpy(&pMsg->sec, &macCoord.realignSec, sizeof(ApiMac_sec_t));

  /* initialize IE pointers */
  pMsg->internal.ptrHeaderIE = NULL;
  pMsg->internal.ptrPayloadIE = NULL;

  status = MAP_macBuildHeader(pMsg, SADDR_MODE_EXT, pDstAddr, MAC_PAN_ID_BROADCAST, 0);
  if (status == MAC_SUCCESS)
  {
    /* queue frame for transmission */
    MAP_macDataTxEnqueue(pMsg);
  }
  return status;
}

