nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_coord.c
/**************************************************************************************************
 * @fn          macIndirectMark
 *
 * @brief       This function searches through the data queue for indirect frames matching
 *              the given address.  The last matching frame in the queue is marked.  This
 *              mark is used to optimize building of the pending address list in the
 *              beacon frame.
 *
 * input parameters
 *
 * @param       pMsg - message containing address to match.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macIndirectMark(macTx_t *pMsg)
{
  macTx_t       *pCurr;
  macTx_t       *pPrev;
  halIntState_t intState;

  HAL_ENTER_CRITICAL_SECTION(intState);

  pPrev = NULL;
  pCurr = MAP_OSAL_MSG_Q_HEAD(&macData.txQueue);
  while (pCurr != NULL)
  {
    /* if indirect and address matches */
    if ((pCurr->internal.txSched & MAC_TX_SCHED_INDIRECT) &&
        MAP_macDestAddrCmp(pCurr->msdu.p, pMsg->msdu.p))
    {
      /* clear mark */
      pCurr->internal.txSched &= ~MAC_TX_SCHED_MARKED;

      /* save match */
      pPrev = pCurr;
    }
    pCurr = MAP_OSAL_MSG_NEXT(pCurr);
  }

  /* if match found */
  if (pPrev != NULL)
  {
    /* mark it */
    pPrev->internal.txSched |= MAC_TX_SCHED_MARKED;
  }

  HAL_EXIT_CRITICAL_SECTION(intState);
}
/**************************************************************************************************
 * @fn          macApiPurgeReq
 *
 * @brief       This action function handles the API purge request event.  It searches the tx
 *              queue for an indirect data frame with a matching handle.  If found, it removes
 *              the frame from the queue.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macApiPurgeReq(macEvent_t *pEvent)
{
  macMcpsDataReq_t  *pCurr;
  macMcpsDataReq_t  *pPrev = NULL;
  uint8             status = MAC_INVALID_HANDLE;
  halIntState_t     intState;

  HAL_ENTER_CRITICAL_SECTION(intState);
  pCurr = MAP_OSAL_MSG_Q_HEAD(&macData.txQueue);
  while (pCurr != NULL)
  {
    /* if indirect data frame with matchine handle */
    if ((pCurr->internal.txSched & MAC_TX_SCHED_INDIRECT) &&
        (pCurr->internal.frameType == MAC_INTERNAL_DATA) &&
        (pCurr->mac.msduHandle == pEvent->api.mac.purgeReq.msduHandle))
    {
      /* remove it from data queue */
      MAP_osal_msg_extract(&macData.txQueue, pCurr, pPrev);

      /* decrement indirect frame count */
      macData.indirectCount--;

      /* we're done */
      break;
    }
    pPrev = pCurr;
    pCurr = MAP_OSAL_MSG_NEXT(pCurr);
  }
  HAL_EXIT_CRITICAL_SECTION(intState);

  /* if frame found */
  if (pCurr != NULL)
  {
    /* mark indirect queue for removed frame */
    MAP_macIndirectMark((macTx_t *) pCurr);

    /* send data cnf callback for removed frame */
    MAP_macCbackForEvent((macEvent_t *) pCurr, MAC_TRANSACTION_EXPIRED);

    status = MAC_SUCCESS;
  }

  /* send purge cnf callback */
  MAP_macCbackForEvent(pEvent, status);
}

/**************************************************************************************************
 * @fn          macApiStartReq
 *
 * @brief       This action function handles an API start request event.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
#if !defined (TIMAC_ROM_PATCH)
MAC_INTERNAL_API void macApiStartReq(macEvent_t *pEvent)
{
  uint8   status;
  macTx_t *pMsg;
  sAddr_t dstAddr;

  if((pEvent->hdr.status  != MAC_UNAVAILABLE_KEY) &&
       (pEvent->hdr.status  != MAC_UNSUPPORTED_SECURITY) &&
       (pEvent->hdr.status  != MAC_INVALID_PARAMETER) &&
       (pEvent->hdr.status  != MAC_COUNTER_ERROR))
  {
    /* parameter check */
    status = MAP_macStartBegin(pEvent);

    /* handle coordRealignment */
    if (status == MAC_SUCCESS && pEvent->api.mac.startReq.coordRealignment &&
        (!pEvent->api.mac.startReq.startFH) && !MAC_FH_ENABLED)
    {
      /* allocate buffer */
      if ((pMsg = MAP_macAllocTxBuffer(MAC_INTERNAL_COORD_REALIGN, &pEvent->api.mac.startReq.realignSec)) != NULL)
      {
        dstAddr.addrMode = SADDR_MODE_SHORT;
        dstAddr.addr.shortAddr = MAC_SHORT_ADDR_BROADCAST;
        status = MAP_macBuildRealign(pMsg, &dstAddr, MAC_SHORT_ADDR_BROADCAST,
                                 pEvent->api.mac.startReq.panId,
                                 pEvent->api.mac.startReq.logicalChannel);

        if((status  != MAC_UNAVAILABLE_KEY) &&
           (status  != MAC_UNSUPPORTED_SECURITY) &&
           (status  != MAC_INVALID_PARAMETER) &&
           (status  != MAC_COUNTER_ERROR))
        {
          return;
        }
      }
    }

    pEvent->hdr.status = status;
  }

  MAP_macStartContinue(pEvent);
}
#endif
/**************************************************************************************************
 * @fn          macStartBegin
 *
 * @brief       This function handles begins the processing of a start request.
 *              Here the validity of the parameters are checked and the pStartReq
 *              is allocated.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macStartBegin(macEvent_t *pEvent)
{
  uint8 status = MAC_SUCCESS;

#ifndef FEATURE_WISUN_SUPPORT
  /* check parameters */
  MAC_PARAM_STATUS((pEvent->api.mac.startReq.channelPage == MAC_CHANNEL_PAGE_9) ||
                   (pEvent->api.mac.startReq.channelPage == MAC_CHANNEL_PAGE_10), status);
#endif
  /* verify phy ID */
  MAC_PARAM_STATUS(((pEvent->api.mac.startReq.phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.startReq.phyID <= MAC_MRFSK_STD_PHY_ID_END)) ||
                   ((pEvent->api.mac.startReq.phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.startReq.phyID <= MAC_MRFSK_GENERIC_PHY_ID_END)), status);

  if (MAC_SUCCESS == status)
  {
     /* change Phy ID before starting network */
     MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &pEvent->api.mac.startReq.phyID);
     MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &pEvent->api.mac.startReq.channelPage);

    /* allocate buffer for start parameters */
    if ((macCoord.pStartReq = MAP_osal_mem_alloc(sizeof(ApiMac_mlmeStartReq_t))) != NULL)
    {
      MAP_osal_memcpy(macCoord.pStartReq, &pEvent->api.mac.startReq, sizeof(ApiMac_mlmeStartReq_t));
    }
    else
    {
      status = MAC_NO_RESOURCES;
    }
  }
  return status;
}

