nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_coord.c
/**************************************************************************************************
 * @fn          macStartSetParams
 *
 * @brief       This function sets parameters from an API start request in the MAC.
 *
 * input parameters
 *
 * @param       pStartReq - Pointer to start request data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macStartSetParams(ApiMac_mlmeStartReq_t *pStartReq)
{
  /* set pan coordinator bit in radio; if pan coordinator set pan id and logical channel */
  macPanCoordinator = pStartReq->panCoordinator;
  MAP_macRadioSetPanCoordinator(macPanCoordinator);

  MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &pStartReq->phyID);
  MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &pStartReq->channelPage);

  if (macPanCoordinator)
  {
    MAP_MAC_MlmeSetReq(MAC_PAN_ID, &pStartReq->panId);
    MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, &pStartReq->logicalChannel);
  }

  DBG_PRINT1(DBGSYS, "macStartSetParams(): Setting PhyId = %i", pStartReq->phyID);
  DBG_PRINT1(DBGSYS, "macStartSetParams(): Setting Logical Ch = %i", pStartReq->logicalChannel);

  macMgmt.networkStarted = TRUE;
  macCoord.beaconing = (pMacPib->beaconOrder != MAC_BO_NON_BEACON);

  /* Save security parameters */
  MAP_osal_memcpy(&macCoord.realignSec, &pStartReq->realignSec, sizeof(ApiMac_sec_t));
  MAP_osal_memcpy(&macCoord.beaconSec, &pStartReq->beaconSec, sizeof(ApiMac_sec_t));
}

/**************************************************************************************************
 * @fn          macStartContinue
 *
 * @brief       This action function continues with the start procedure.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macStartContinue(macEvent_t *pEvent)
{
  if ( pEvent->hdr.status == MAC_SUCCESS )
  {
    MAP_macStartSetParams(macCoord.pStartReq);

    /* If start request is made and frequency hopping is enabled
       start the Frequency hopping */
    if (MAC_FH_ENABLED && MAC_FH_START_FN)
    {
      MAC_FH_START_FN();
    }
  }

  /* complete the start */
  pEvent->hdr.event = MAC_INT_START_COMPLETE_EVT;
  MAP_macExecute(pEvent);
}

/**************************************************************************************************
 * @fn          macStartComplete
 *
 * @brief       This action function is called when the start procedure is complete.  The
 *              pMacStartReq buffer is deallocated.  The MAC callback is called with event
 *              MAC_MLME_START_CNF with status from the event.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macStartComplete(macEvent_t *pEvent)
{
  if (macCoord.pStartReq != NULL)
  {
    void *tmp = (void *)macCoord.pStartReq;
    macCoord.pStartReq = NULL;
    MAP_osal_mem_free(tmp);
  }
  pEvent->hdr.event = MAC_MLME_START_CNF;
  MAP_MAC_CbackEvent((macCbackEvent_t *) pEvent);
}

/**************************************************************************************************
 * @fn          macRxDataReq
 *
 * @brief       This function processes a data request command frame.  If the frame was ack'ed
 *              with pending, the indirect frame is searched and frame sent to the requester.
 *              If no frame is found, a zero length data frame is sent. The MAC_MLME_POLL_IND
 *              is sent regardless of ack pending status.  The upper layer can use the noRsp
 *              flag to determine whether to respond to the poll indication with  MAC_McpsDataReq()
 *              or not. If noRsp is set to FALSE, the upp layer can respond to the poll
 *              indication with MAC_McpsDataReq().
 *
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRxDataReq(macEvent_t *pEvent)
{
  macMlmePollInd_t pollInd;
  ApiMac_sec_t     sec;
  uint8            noRsp = TRUE;

  /* if frame was ack'ed with pending */
  if (pEvent->rx.internal.flags & MAC_RX_FLAG_ACK_PENDING)
  {
    /* find and send requested frame */
    if (!MAP_macIndirectSend(&pEvent->rx.mac.srcAddr, pEvent->rx.mac.srcPanId))
    {
      if (macCfg.appPendingQueue == TRUE)
      {
        /* Short address matches, set noRsp flag to FALSE so the upper layer
         * can respond to the poll indication with MAC_McpsDataReq().
         */
        noRsp = FALSE;
      }
      else
      {
        /* copy the security settings for zero length data */
        MAP_osal_memcpy(&sec, &pEvent->rx.sec , sizeof(ApiMac_sec_t));

        /* if not found send empty data frame */
        MAP_macBuildCommonReq(MAC_INTERNAL_ZERO_DATA, MAP_macGetMyAddrMode(), &pEvent->rx.mac.srcAddr,
                          pEvent->rx.mac.srcPanId, MAC_TXOPTION_NO_RETRANS | MAC_TXOPTION_NO_CNF, &sec);
      }
    }
  }

  /* Send MAC_MLME_POLL_IND regardless of ack pending status */
  pollInd.hdr.event    = MAC_MLME_POLL_IND;
  MAP_sAddrCpy(&pollInd.srcAddr, &pEvent->rx.mac.srcAddr);
  pollInd.srcPanId     = pEvent->rx.mac.srcPanId;
  pollInd.noRsp        = noRsp;
  MAP_MAC_CbackEvent((macCbackEvent_t *) &pollInd);
}

/**************************************************************************************************
 * @fn          macRxPanConflict
 *
 * @brief       This function handles a PAN ID conflict command frame.  If configured as a
 *              PAN coordinator a sync loss indication is issued.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRxPanConflict(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  if (macPanCoordinator)
  {
    MAP_macConflictSyncLossInd();
  }
}

