nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_coord.c
/**************************************************************************************************
 * @fn          MAC_InitCoord
 *
 * @brief       This function initializes the MAC as a coordinator.  It loads coordinator
 *              action functions into the state machine action table.  It also configures the
 *              state machine to use state tables required for operation as a device.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void MAC_InitCoord(void)
{
  /* Initialize action set for actions specific to Coordinator node */
  macActionSet[MAC_COORD_ACTION_1] = macCoordAction1;
  macActionSet[MAC_COORD_ACTION_2] = macCoordAction2;
  macActionSet[MAC_COORD_ACTION_3] = macCoordAction3;
#ifndef FEATURE_WISUN_SUPPORT
  macStateTbl[MAC_STARTING_ST] = macStartingSt;
#endif
  macReset[MAC_FEAT_COORD] = MAP_macCoordReset;

#ifndef FEATURE_WISUN_SUPPORT
  macDataTxIndirect = MAP_macIndirectTxFrame;
  macDataRequeueIndirect = MAP_macIndirectRequeueFrame;
#else
  macDataTxIndirect = NULL;
  macDataRequeueIndirect = NULL;
#endif
  /* tx frame set schedule function */
  macDataSetSched = MAP_macSetSched;
  /* tx frame check schedule function */
  macDataCheckSched = MAP_macCheckSched;

  macMain.featureMask |= MAC_FEAT_COORD_MASK;
}
/**************************************************************************************************
 * @fn          MAC_McpsPurgeReq
 *
 * @brief       This function is called by the application to purge a data request from the MAC
 *              data queue.  The function allocates an OSAL message and sends a
 *              MAC_API_PURGE_REQ_EVT to the MAC.
 *
 * input parameters
 *
 * @param       msduHandle - The application-defined handle value
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS or MAC error code.
 **************************************************************************************************
 */
uint8 MAC_McpsPurgeReq(uint8 msduHandle)
{
  macMcpsPurgeReq_t purgeReq;

  purgeReq.msduHandle = msduHandle;
  return (MAP_macSendMsg(MAC_API_PURGE_REQ_EVT, &purgeReq));
}

/**************************************************************************************************
 * @fn          MAC_MlmeStartReq
 *
 * @brief       This function calls macSendMsg() to send an OSAL message containing a
 *              MAC_API_START_REQ_EVT to the MAC.
 *
 * input parameters
 *
 * @param       pData - Pointer to parameters structure.
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS or MAC error code.
 **************************************************************************************************
 */
uint8 MAC_MlmeStartReq(ApiMac_mlmeStartReq_t *pData)
{
  return (MAP_macSendMsg(MAC_API_START_REQ_EVT, pData));
}
